docs/performance/raw/20260926-a058-329/t20p20r3-browse200/k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/webhook-under-browse.js
        output: -

     scenarios: (100.00%) 3 scenarios, 3900 max VUs, 1m15s max duration (incl. graceful stop):
              * browse: 200.00 iterations/s for 45s (maxVUs: 300-3000, exec: browseOnce, gracefulStop: 30s)
              * hook: 10.00 iterations/s for 45s (maxVUs: 40-300, exec: webhookOnce, gracefulStop: 30s)
              * pay: 50.00 iterations/s for 45s (maxVUs: 200-600, exec: payOnce, gracefulStop: 30s)


running (0m00.9s), 0066/0540 VUs, 174 complete and 0 interrupted iterations
browse   [   2% ] 0019/0300 VUs  00.9s/45s  200.00 iters/s
hook     [   2% ] 001/040 VUs    00.9s/45s  10.00 iters/s
pay      [   2% ] 046/200 VUs    00.9s/45s  50.00 iters/s

running (0m01.9s), 0079/0540 VUs, 420 complete and 0 interrupted iterations
browse   [   4% ] 0017/0300 VUs  01.9s/45s  200.00 iters/s
hook     [   4% ] 002/040 VUs    01.9s/45s  10.00 iters/s
pay      [   4% ] 061/200 VUs    01.9s/45s  50.00 iters/s

running (0m02.9s), 0083/0540 VUs, 676 complete and 0 interrupted iterations
browse   [   6% ] 0020/0300 VUs  02.9s/45s  200.00 iters/s
hook     [   6% ] 002/040 VUs    02.9s/45s  10.00 iters/s
pay      [   6% ] 061/200 VUs    02.9s/45s  50.00 iters/s

running (0m03.9s), 0084/0540 VUs, 935 complete and 0 interrupted iterations
browse   [   9% ] 0020/0300 VUs  03.9s/45s  200.00 iters/s
hook     [   9% ] 002/040 VUs    03.9s/45s  10.00 iters/s
pay      [   9% ] 062/200 VUs    03.9s/45s  50.00 iters/s

running (0m04.9s), 0085/0540 VUs, 1195 complete and 0 interrupted iterations
browse   [  11% ] 0022/0300 VUs  04.9s/45s  200.00 iters/s
hook     [  11% ] 002/040 VUs    04.9s/45s  10.00 iters/s
pay      [  11% ] 061/200 VUs    04.9s/45s  50.00 iters/s

running (0m05.9s), 0083/0540 VUs, 1457 complete and 0 interrupted iterations
browse   [  13% ] 0021/0300 VUs  05.9s/45s  200.00 iters/s
hook     [  13% ] 002/040 VUs    05.9s/45s  10.00 iters/s
pay      [  13% ] 060/200 VUs    05.9s/45s  50.00 iters/s

running (0m06.9s), 0085/0540 VUs, 1715 complete and 0 interrupted iterations
browse   [  15% ] 0020/0300 VUs  06.9s/45s  200.00 iters/s
hook     [  15% ] 001/040 VUs    06.9s/45s  10.00 iters/s
pay      [  15% ] 064/200 VUs    06.9s/45s  50.00 iters/s

running (0m07.9s), 0074/0540 VUs, 1986 complete and 0 interrupted iterations
browse   [  18% ] 0020/0300 VUs  07.9s/45s  200.00 iters/s
hook     [  18% ] 001/040 VUs    07.9s/45s  10.00 iters/s
pay      [  18% ] 053/200 VUs    07.9s/45s  50.00 iters/s

running (0m08.9s), 0075/0540 VUs, 2245 complete and 0 interrupted iterations
browse   [  20% ] 0019/0300 VUs  08.9s/45s  200.00 iters/s
hook     [  20% ] 001/040 VUs    08.9s/45s  10.00 iters/s
pay      [  20% ] 055/200 VUs    08.9s/45s  50.00 iters/s

running (0m09.9s), 0078/0540 VUs, 2502 complete and 0 interrupted iterations
browse   [  22% ] 0020/0300 VUs  09.9s/45s  200.00 iters/s
hook     [  22% ] 001/040 VUs    09.9s/45s  10.00 iters/s
pay      [  22% ] 057/200 VUs    09.9s/45s  50.00 iters/s

running (0m10.9s), 0086/0540 VUs, 2754 complete and 0 interrupted iterations
browse   [  24% ] 0021/0300 VUs  10.9s/45s  200.00 iters/s
hook     [  24% ] 002/040 VUs    10.9s/45s  10.00 iters/s
pay      [  24% ] 063/200 VUs    10.9s/45s  50.00 iters/s

running (0m11.9s), 0072/0540 VUs, 3028 complete and 0 interrupted iterations
browse   [  26% ] 0016/0300 VUs  11.9s/45s  200.00 iters/s
hook     [  26% ] 001/040 VUs    11.9s/45s  10.00 iters/s
pay      [  26% ] 055/200 VUs    11.9s/45s  50.00 iters/s

running (0m12.9s), 0070/0540 VUs, 3290 complete and 0 interrupted iterations
browse   [  29% ] 0020/0300 VUs  12.9s/45s  200.00 iters/s
hook     [  29% ] 001/040 VUs    12.9s/45s  10.00 iters/s
pay      [  29% ] 049/200 VUs    12.9s/45s  50.00 iters/s

running (0m13.9s), 0081/0540 VUs, 3538 complete and 0 interrupted iterations
browse   [  31% ] 0020/0300 VUs  13.9s/45s  200.00 iters/s
hook     [  31% ] 001/040 VUs    13.9s/45s  10.00 iters/s
pay      [  31% ] 060/200 VUs    13.9s/45s  50.00 iters/s

running (0m14.9s), 0069/0540 VUs, 3811 complete and 0 interrupted iterations
browse   [  33% ] 0014/0300 VUs  14.9s/45s  200.00 iters/s
hook     [  33% ] 001/040 VUs    14.9s/45s  10.00 iters/s
pay      [  33% ] 054/200 VUs    14.9s/45s  50.00 iters/s

running (0m15.9s), 0072/0540 VUs, 4068 complete and 0 interrupted iterations
browse   [  35% ] 0014/0300 VUs  15.9s/45s  200.00 iters/s
hook     [  35% ] 001/040 VUs    15.9s/45s  10.00 iters/s
pay      [  35% ] 057/200 VUs    15.9s/45s  50.00 iters/s

running (0m16.9s), 0080/0540 VUs, 4319 complete and 0 interrupted iterations
browse   [  38% ] 0018/0300 VUs  16.9s/45s  200.00 iters/s
hook     [  38% ] 001/040 VUs    16.9s/45s  10.00 iters/s
pay      [  38% ] 061/200 VUs    16.9s/45s  50.00 iters/s

running (0m17.9s), 0081/0540 VUs, 4579 complete and 0 interrupted iterations
browse   [  40% ] 0021/0300 VUs  17.9s/45s  200.00 iters/s
hook     [  40% ] 002/040 VUs    17.9s/45s  10.00 iters/s
pay      [  40% ] 058/200 VUs    17.9s/45s  50.00 iters/s

running (0m18.9s), 0053/0540 VUs, 4867 complete and 0 interrupted iterations
browse   [  42% ] 0010/0300 VUs  18.9s/45s  200.00 iters/s
hook     [  42% ] 000/040 VUs    18.9s/45s  10.00 iters/s
pay      [  42% ] 043/200 VUs    18.9s/45s  50.00 iters/s

running (0m19.9s), 0072/0540 VUs, 5108 complete and 0 interrupted iterations
browse   [  44% ] 0019/0300 VUs  19.9s/45s  200.00 iters/s
hook     [  44% ] 001/040 VUs    19.9s/45s  10.00 iters/s
pay      [  44% ] 052/200 VUs    19.9s/45s  50.00 iters/s

running (0m20.9s), 0081/0540 VUs, 5359 complete and 0 interrupted iterations
browse   [  46% ] 0019/0300 VUs  20.9s/45s  200.00 iters/s
hook     [  46% ] 001/040 VUs    20.9s/45s  10.00 iters/s
pay      [  46% ] 061/200 VUs    20.9s/45s  50.00 iters/s

running (0m21.9s), 0074/0540 VUs, 5626 complete and 0 interrupted iterations
browse   [  49% ] 0019/0300 VUs  21.9s/45s  200.00 iters/s
hook     [  49% ] 001/040 VUs    21.9s/45s  10.00 iters/s
pay      [  49% ] 054/200 VUs    21.9s/45s  50.00 iters/s

running (0m22.9s), 0060/0540 VUs, 5899 complete and 0 interrupted iterations
browse   [  51% ] 0007/0300 VUs  22.9s/45s  200.00 iters/s
hook     [  51% ] 001/040 VUs    22.9s/45s  10.00 iters/s
pay      [  51% ] 052/200 VUs    22.9s/45s  50.00 iters/s

running (0m23.9s), 0078/0540 VUs, 6141 complete and 0 interrupted iterations
browse   [  53% ] 0019/0300 VUs  23.9s/45s  200.00 iters/s
hook     [  53% ] 001/040 VUs    23.9s/45s  10.00 iters/s
pay      [  53% ] 058/200 VUs    23.9s/45s  50.00 iters/s

running (0m24.9s), 0072/0540 VUs, 6408 complete and 0 interrupted iterations
browse   [  55% ] 0019/0300 VUs  24.9s/45s  200.00 iters/s
hook     [  55% ] 001/040 VUs    24.9s/45s  10.00 iters/s
pay      [  55% ] 052/200 VUs    24.9s/45s  50.00 iters/s

running (0m25.9s), 0085/0540 VUs, 6655 complete and 0 interrupted iterations
browse   [  58% ] 0021/0300 VUs  25.9s/45s  200.00 iters/s
hook     [  58% ] 001/040 VUs    25.9s/45s  10.00 iters/s
pay      [  58% ] 063/200 VUs    25.9s/45s  50.00 iters/s

running (0m26.9s), 0073/0540 VUs, 6926 complete and 0 interrupted iterations
browse   [  60% ] 0017/0300 VUs  26.9s/45s  200.00 iters/s
hook     [  60% ] 001/040 VUs    26.9s/45s  10.00 iters/s
pay      [  60% ] 055/200 VUs    26.9s/45s  50.00 iters/s

running (0m27.9s), 0075/0540 VUs, 7185 complete and 0 interrupted iterations
browse   [  62% ] 0021/0300 VUs  27.9s/45s  200.00 iters/s
hook     [  62% ] 001/040 VUs    27.9s/45s  10.00 iters/s
pay      [  62% ] 053/200 VUs    27.9s/45s  50.00 iters/s

running (0m28.9s), 0074/0540 VUs, 7446 complete and 0 interrupted iterations
browse   [  64% ] 0018/0300 VUs  28.9s/45s  200.00 iters/s
hook     [  64% ] 001/040 VUs    28.9s/45s  10.00 iters/s
pay      [  64% ] 055/200 VUs    28.9s/45s  50.00 iters/s

running (0m29.9s), 0075/0540 VUs, 7705 complete and 0 interrupted iterations
browse   [  66% ] 0021/0300 VUs  29.9s/45s  200.00 iters/s
hook     [  66% ] 001/040 VUs    29.9s/45s  10.00 iters/s
pay      [  66% ] 053/200 VUs    29.9s/45s  50.00 iters/s

running (0m30.9s), 0077/0540 VUs, 7963 complete and 0 interrupted iterations
browse   [  69% ] 0018/0300 VUs  30.9s/45s  200.00 iters/s
hook     [  69% ] 001/040 VUs    30.9s/45s  10.00 iters/s
pay      [  69% ] 058/200 VUs    30.9s/45s  50.00 iters/s

running (0m31.9s), 0079/0540 VUs, 8221 complete and 0 interrupted iterations
browse   [  71% ] 0020/0300 VUs  31.9s/45s  200.00 iters/s
hook     [  71% ] 001/040 VUs    31.9s/45s  10.00 iters/s
pay      [  71% ] 058/200 VUs    31.9s/45s  50.00 iters/s

running (0m32.9s), 0057/0540 VUs, 8503 complete and 0 interrupted iterations
browse   [  73% ] 0010/0300 VUs  32.9s/45s  200.00 iters/s
hook     [  73% ] 001/040 VUs    32.9s/45s  10.00 iters/s
pay      [  73% ] 046/200 VUs    32.9s/45s  50.00 iters/s

running (0m33.9s), 0070/0540 VUs, 8749 complete and 0 interrupted iterations
browse   [  75% ] 0017/0300 VUs  33.9s/45s  200.00 iters/s
hook     [  75% ] 001/040 VUs    33.9s/45s  10.00 iters/s
pay      [  75% ] 052/200 VUs    33.9s/45s  50.00 iters/s

running (0m34.9s), 0049/0540 VUs, 9031 complete and 0 interrupted iterations
browse   [  78% ] 0007/0300 VUs  34.9s/45s  200.00 iters/s
hook     [  78% ] 000/040 VUs    34.9s/45s  10.00 iters/s
pay      [  78% ] 042/200 VUs    34.9s/45s  50.00 iters/s

running (0m35.9s), 0053/0540 VUs, 9287 complete and 0 interrupted iterations
browse   [  80% ] 0010/0300 VUs  35.9s/45s  200.00 iters/s
hook     [  80% ] 000/040 VUs    35.9s/45s  10.00 iters/s
pay      [  80% ] 043/200 VUs    35.9s/45s  50.00 iters/s

running (0m36.9s), 0085/0540 VUs, 9515 complete and 0 interrupted iterations
browse   [  82% ] 0021/0300 VUs  36.9s/45s  200.00 iters/s
hook     [  82% ] 002/040 VUs    36.9s/45s  10.00 iters/s
pay      [  82% ] 062/200 VUs    36.9s/45s  50.00 iters/s

running (0m37.9s), 0070/0540 VUs, 9790 complete and 0 interrupted iterations
browse   [  84% ] 0020/0300 VUs  37.9s/45s  200.00 iters/s
hook     [  84% ] 001/040 VUs    37.9s/45s  10.00 iters/s
pay      [  84% ] 049/200 VUs    37.9s/45s  50.00 iters/s

running (0m38.9s), 0071/0540 VUs, 10049 complete and 0 interrupted iterations
browse   [  86% ] 0017/0300 VUs  38.9s/45s  200.00 iters/s
hook     [  86% ] 001/040 VUs    38.9s/45s  10.00 iters/s
pay      [  86% ] 053/200 VUs    38.9s/45s  50.00 iters/s

running (0m39.9s), 0073/0540 VUs, 10306 complete and 0 interrupted iterations
browse   [  89% ] 0019/0300 VUs  39.9s/45s  200.00 iters/s
hook     [  89% ] 001/040 VUs    39.9s/45s  10.00 iters/s
pay      [  89% ] 053/200 VUs    39.9s/45s  50.00 iters/s

running (0m40.9s), 0073/0540 VUs, 10566 complete and 0 interrupted iterations
browse   [  91% ] 0019/0300 VUs  40.9s/45s  200.00 iters/s
hook     [  91% ] 001/040 VUs    40.9s/45s  10.00 iters/s
pay      [  91% ] 053/200 VUs    40.9s/45s  50.00 iters/s

running (0m41.9s), 0073/0540 VUs, 10827 complete and 0 interrupted iterations
browse   [  93% ] 0020/0300 VUs  41.9s/45s  200.00 iters/s
hook     [  93% ] 001/040 VUs    41.9s/45s  10.00 iters/s
pay      [  93% ] 052/200 VUs    41.9s/45s  50.00 iters/s

running (0m42.9s), 0070/0540 VUs, 11090 complete and 0 interrupted iterations
browse   [  95% ] 0017/0300 VUs  42.9s/45s  200.00 iters/s
hook     [  95% ] 002/040 VUs    42.9s/45s  10.00 iters/s
pay      [  95% ] 051/200 VUs    42.9s/45s  50.00 iters/s

running (0m43.9s), 0074/0540 VUs, 11346 complete and 0 interrupted iterations
browse   [  98% ] 0022/0300 VUs  43.9s/45s  200.00 iters/s
hook     [  98% ] 001/040 VUs    43.9s/45s  10.00 iters/s
pay      [  98% ] 051/200 VUs    43.9s/45s  50.00 iters/s

running (0m44.9s), 0073/0540 VUs, 11607 complete and 0 interrupted iterations
browse   [ 100% ] 0021/0300 VUs  44.9s/45s  200.00 iters/s
hook     [ 100% ] 001/040 VUs    44.9s/45s  10.00 iters/s
pay      [ 100% ] 051/200 VUs    44.9s/45s  50.00 iters/s

running (0m45.9s), 0029/0540 VUs, 11674 complete and 0 interrupted iterations
browse ✓ [ 100% ] 0000/0300 VUs  45s  200.00 iters/s
hook   ✓ [ 100% ] 000/040 VUs    45s  10.00 iters/s
pay    ↓ [ 100% ] 052/200 VUs    45s  50.00 iters/s


  █ THRESHOLDS 

    http_req_duration{name:confirm}
    ✓ 'p(95)<600000' p(95)=5.37s

    http_req_duration{name:webhook}
    ✓ 'p(95)<600000' p(95)=214.91ms


  █ TOTAL RESULTS 

    checks_total.......: 1       0.021382/s
    checks_succeeded...: 100.00% 1 out of 1
    checks_failed......: 0.00%   0 out of 1

    ✓ login 200

    CUSTOM
    browse_2xx.....................: 6227   133.146155/s
    browse_503.....................: 2774   59.313864/s
    browse_ms......................: avg=91.61ms  med=55.92ms  max=671.19ms p(90)=275.55ms p(95)=334.8ms  p(99)=429.63ms
    webhook_ms.....................: avg=73.68ms  med=56.3ms   max=381.62ms p(90)=149.05ms p(95)=214.91ms p(99)=318.08ms
    webhook_over_10s...............: 0.00%  0 out of 451

    HTTP
    http_req_duration..............: avg=241.66ms med=72.11ms  max=5.92s    p(90)=304.33ms p(95)=394.73ms p(99)=5.35s   
      { expected_response:true }...: avg=317.09ms med=79.99ms  max=5.92s    p(90)=320.36ms p(95)=424ms    p(99)=5.4s    
      { name:confirm }.............: avg=1.03s    med=222.14ms max=5.92s    p(90)=5.27s    p(95)=5.37s    p(99)=5.54s   
      { name:webhook }.............: avg=73.68ms  med=56.3ms   max=381.62ms p(90)=149.05ms p(95)=214.91ms p(99)=318.08ms
    http_req_failed................: 33.42% 4665 out of 13955
    http_reqs......................: 13955  298.386798/s

    EXECUTION
    iteration_duration.............: avg=288.55ms med=76.54ms  max=5.99s    p(90)=364.32ms p(95)=473.34ms p(99)=5.45s   
    iterations.....................: 11703  250.234374/s
    vus............................: 29     min=29            max=86 
    vus_max........................: 540    min=540           max=540

    NETWORK
    data_received..................: 31 MB  665 kB/s
    data_sent......................: 3.5 MB 75 kB/s



running (0m46.8s), 0000/0540 VUs, 11703 complete and 0 interrupted iterations
browse ✓ [ 100% ] 0000/0300 VUs  45s  200.00 iters/s
hook   ✓ [ 100% ] 000/040 VUs    45s  10.00 iters/s
pay    ✓ [ 100% ] 000/200 VUs    45s  50.00 iters/s